; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v7 ?v5)
             (pred_12 ?v1 ?v8)
             (pred_6 ?v7 ?v8)
             (pred_3 ?v2 ?v7 )
	     (pred_11 ?v7)
             (pred_1 ?v9)
             (pred_10 ?v1)
             (pred_9 ?v8)
             (pred_8 ?v7)
             (pred_7 ?v1)
             (pred_4 ?v7)
             (pred_2 ))



(:action op_1
:parameters (?v6 ?v4 ?v10 ?v13)
:precondition (and (pred_1 ?v6) (pred_1 ?v4) (pred_10 ?v10) (pred_9 ?v13)
          (pred_5 ?v6 ?v4) (pred_12 ?v10 ?v13)
                   (pred_6 ?v4 ?v13) (pred_11 ?v6) 
                   (pred_8 ?v4) (pred_7 ?v10))
:effect (and  (pred_4 ?v4) (not (pred_8 ?v4))))


(:action op_5
:parameters (?v6 ?v12)
:precondition (and (pred_1 ?v6) (pred_1 ?v12)
               (pred_11 ?v6) (pred_5 ?v6 ?v12) (pred_4 ?v12))
:effect (and (pred_11 ?v12) (not (pred_11 ?v6))))

(:action op_4
:parameters (?v6 ?v10)
:precondition (and (pred_1 ?v6) (pred_10 ?v10) 
                  (pred_11 ?v6) (pred_3 ?v10 ?v6) (pred_2 ))
:effect (and (pred_7 ?v10)
   (not (pred_3 ?v10 ?v6)) (not (pred_2 ))))


(:action op_2
:parameters (?v6 ?v3 ?v11)
:precondition (and (pred_1 ?v6) (pred_10 ?v3) (pred_10 ?v11)
                  (pred_11 ?v6) (pred_7 ?v11) (pred_3 ?v3 ?v6))
:effect (and (pred_7 ?v3) (pred_3 ?v11 ?v6)
        (not (pred_7 ?v11)) (not (pred_3 ?v3 ?v6))))

(:action op_3
:parameters (?v6 ?v10)
:precondition (and (pred_1 ?v6) (pred_10 ?v10) 
                  (pred_11 ?v6) (pred_7 ?v10))
:effect (and (pred_2 ) (pred_3 ?v10 ?v6) (not (pred_7 ?v10)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_02 obj_10 obj_13 obj_09 obj_06 obj_08 obj_04 obj_11
    obj_03 obj_05
    obj_12 obj_01
    )

    (:init
       (pred_2)

       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_1 obj_10)
       (pred_1 obj_13)
       (pred_1 obj_09)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_04)
       (pred_1 obj_11)
       (pred_9 obj_03)
       (pred_9 obj_05)
       (pred_10 obj_12)
       (pred_10 obj_01)

       (pred_5 obj_07 obj_13)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_02 obj_09)
       (pred_5 obj_02 obj_10)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_10 obj_06)
       (pred_5 obj_10 obj_02)
       (pred_5 obj_13 obj_08)
       (pred_5 obj_13 obj_09)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_06)
       (pred_5 obj_09 obj_02)
       (pred_5 obj_09 obj_13)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_06 obj_10)
       (pred_5 obj_06 obj_09)
       (pred_5 obj_08 obj_04)
       (pred_5 obj_08 obj_13)
       (pred_5 obj_04 obj_11)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_04 obj_08)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_11 obj_04)
       (pred_8 obj_11)
       (pred_8 obj_07)
       (pred_6  obj_11 obj_03)
       (pred_6  obj_07 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_10)
       (pred_4 obj_13)
       (pred_4 obj_09)
       (pred_4 obj_06)
       (pred_4 obj_08)
       (pred_4 obj_04)

       (pred_12  obj_12 obj_03)
       (pred_12  obj_01 obj_05)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_01 obj_10)
       (pred_11 obj_10)
    )

    (:goal (and
       (pred_3 obj_01 obj_07)
    ))
(:constraints
  (always (not (pred_11 obj_02)))
)
)

; plan
1. (op_4 obj_10 obj_01)
   deleted: (pred_3 obj_01 obj_10) (pred_2)
   added: (pred_7 obj_01)
   goals met: 0 of 1
2. (op_5 obj_10 obj_06)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_06)
   goals met: 0 of 1
3. (op_5 obj_06 obj_09)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_09)
   goals met: 0 of 1
4. (op_5 obj_09 obj_13)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_13)
   goals met: 0 of 1
5. (op_1 obj_13 obj_07 obj_01 obj_05)
   deleted: (pred_8 obj_07)
   added: (pred_4 obj_07)
   goals met: 0 of 1
6. (op_5 obj_13 obj_07)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_07)
   goals met: 0 of 1
7. (op_3 obj_07 obj_01)
   deleted: (pred_7 obj_01)
   added: (pred_2) (pred_3 obj_01 obj_07)
   goals met: 1 of 1
